;
! function(window, NAME) {

    var maxLen = 189;
    var className = NAME.slice(0, 1).toLowerCase() + NAME.slice(1, -1);

    // 图片模板
    var imageTmp = '<img class="' + className + '" src="';

    // 麻烦把路径写死了!!
    var path = "./images/";

    var emoji = {
        length: maxLen,
        /**
         * 初始化 emoji 表情放置的基础路径，不设置，则使用默认值
         * 同时，初始化 emoji 表情的配置
         * @param {String?} basePath 基础路径
         * @param {Object} config    emoji表情路径配置
         */
        init: function(basePath, config) {
            basePath && (path = basePath);
            this._emoji = config || {
                "01": {
                    "key": "😄"
                },
                "02": {
                    "key": "😃"
                },
                "03": {
                    "key": "😀"
                },
                "04": {
                    "key": "😊"
                },
                "05": {
                    "key": "☺"
                },
                "06": {
                    "key": "😉"
                },
                "07": {
                    "key": "😍"
                },
                "08": {
                    "key": "😘"
                },
                "09": {
                    "key": "😚"
                },
                "10": {
                    "key": "😗"
                },
                "11": {
                    "key": "😙"
                },
                "12": {
                    "key": "😜"
                },
                "13": {
                    "key": "😝"
                },
                "14": {
                    "key": "😛"
                },
                "15": {
                    "key": "😳"
                },
                "16": {
                    "key": "😁"
                },
                "17": {
                    "key": "😔"
                },
                "18": {
                    "key": "😌"
                },
                "19": {
                    "key": "😒"
                },
                "20": {
                    "key": "😞"
                },
                "21": {
                    "key": "😣"
                },
                "22": {
                    "key": "😢"
                },
                "23": {
                    "key": "😂"
                },
                "24": {
                    "key": "😭"
                },
                "25": {
                    "key": "😪"
                },
                "26": {
                    "key": "😥"
                },
                "27": {
                    "key": "😰"
                },
                "28": {
                    "key": "😅"
                },
                "29": {
                    "key": "😓"
                },
                "30": {
                    "key": "😩"
                },
                "31": {
                    "key": "😫"
                },
                "32": {
                    "key": "😨"
                },
                "33": {
                    "key": "😱"
                },
                "34": {
                    "key": "😠"
                },
                "35": {
                    "key": "😡"
                },
                "36": {
                    "key": "😤"
                },
                "37": {
                    "key": "😖"
                },
                "38": {
                    "key": "😆"
                },
                "39": {
                    "key": "😋"
                },
                "40": {
                    "key": "😷"
                },
                "41": {
                    "key": "😎"
                },
                "42": {
                    "key": "😴"
                },
                "43": {
                    "key": "😵"
                },
                "44": {
                    "key": "😲"
                },
                "45": {
                    "key": "😟"
                },
                "46": {
                    "key": "😦"
                },
                "47": {
                    "key": "😧"
                },
                "48": {
                    "key": "😈"
                },
                "49": {
                    "key": "👿"
                },
                "50": {
                    "key": "😮"
                },
                "51": {
                    "key": "😬"
                },
                "52": {
                    "key": "😐"
                },
                "53": {
                    "key": "😕"
                },
                "54": {
                    "key": "😯"
                },
                "55": {
                    "key": "😶"
                },
                "56": {
                    "key": "😇"
                },
                "57": {
                    "key": "😏"
                },
                "58": {
                    "key": "😑"
                },
                "59": {
                    "key": "👲🏿"
                },
                "60": {
                    "key": "👳🏿"
                },
                "61": {
                    "key": "👮🏿"
                },
                "62": {
                    "key": "👷🏿"
                },
                "63": {
                    "key": "💂🏿"
                },
                "64": {
                    "key": "👶🏿"
                },
                "65": {
                    "key": "👦🏿"
                },
                "66": {
                    "key": "👧🏿"
                },
                "67": {
                    "key": "👨🏿"
                },
                "68": {
                    "key": "👩🏿"
                },
                "69": {
                    "key": "👴🏿"
                },
                "70": {
                    "key": "👵🏿"
                },
                "71": {
                    "key": "👱🏿"
                },
                "72": {
                    "key": "👼🏿"
                },
                "73": {
                    "key": "👸🏿"
                },
                "74": {
                    "key": "😺"
                },
                "75": {
                    "key": "😸"
                },
                "76": {
                    "key": "😻"
                },
                "77": {
                    "key": "😽"
                },
                "78": {
                    "key": "😼"
                },
                "79": {
                    "key": "🙀"
                },
                "80": {
                    "key": "😿"
                },
                "81": {
                    "key": "😹"
                },
                "82": {
                    "key": "😾"
                },
                "83": {
                    "key": "👹"
                },
                "84": {
                    "key": "👺"
                },
                "85": {
                    "key": "🙈"
                },
                "86": {
                    "key": "🙉"
                },
                "87": {
                    "key": "🙊"
                },
                "88": {
                    "key": "💀"
                },
                "89": {
                    "key": "👽"
                },
                "90": {
                    "key": "💩"
                },
                "91": {
                    "key": "🔥"
                },
                "92": {
                    "key": "✨"
                },
                "93": {
                    "key": "🌟"
                },
                "94": {
                    "key": "💫"
                },
                "95": {
                    "key": "💥"
                },
                "96": {
                    "key": "💢"
                },
                "97": {
                    "key": "💦"
                },
                "98": {
                    "key": "💧"
                },
                "99": {
                    "key": "💤"
                },
                "100": {
                    "key": "💨"
                },
                "101": {
                    "key": "👂🏿"
                },
                "102": {
                    "key": "👀"
                },
                "103": {
                    "key": "👃🏿"
                },
                "104": {
                    "key": "👅"
                },
                "105": {
                    "key": "👄"
                },
                "106": {
                    "key": "👍🏿"
                },
                "107": {
                    "key": "👎🏿"
                },
                "108": {
                    "key": "👌🏿"
                },
                "109": {
                    "key": "👊🏿"
                },
                "110": {
                    "key": "✊🏿"
                },
                "111": {
                    "key": "✌🏿"
                },
                "112": {
                    "key": "👋🏿"
                },
                "113": {
                    "key": "✋🏿"
                },
                "114": {
                    "key": "👐🏿"
                },
                "115": {
                    "key": "👆🏿"
                },
                "116": {
                    "key": "👇🏿"
                },
                "117": {
                    "key": "👉🏿"
                },
                "118": {
                    "key": "👈🏿"
                },
                "119": {
                    "key": "🙌🏿"
                },
                "120": {
                    "key": "🙏🏿"
                },
                "121": {
                    "key": "☝🏿"
                },
                "122": {
                    "key": "👏🏿"
                },
                "123": {
                    "key": "💪🏿"
                },
                "124": {
                    "key": "🚶🏿"
                },
                "125": {
                    "key": "🏃🏿"
                },
                "126": {
                    "key": "💃🏿"
                },
                "127": {
                    "key": "👫"
                },
                "128": {
                    "key": "👪"
                },
                "129": {
                    "key": "👬"
                },
                "130": {
                    "key": "👭"
                },
                "131": {
                    "key": "💏"
                },
                "132": {
                    "key": "💑"
                },
                "133": {
                    "key": "👯"
                },
                "134": {
                    "key": "🙆🏿"
                },
                "135": {
                    "key": "🙅🏿"
                },
                "136": {
                    "key": "💁🏿"
                },
                "137": {
                    "key": "🙋🏿"
                },
                "138": {
                    "key": "💆🏿"
                },
                "139": {
                    "key": "💇🏿"
                },
                "140": {
                    "key": "💅🏿"
                },
                "141": {
                    "key": "👰🏿"
                },
                "142": {
                    "key": "🙎🏿"
                },
                "143": {
                    "key": "🙍🏿"
                },
                "144": {
                    "key": "🙇🏿"
                },
                "145": {
                    "key": "🎩"
                },
                "146": {
                    "key": "👑"
                },
                "147": {
                    "key": "👒"
                },
                "148": {
                    "key": "👟"
                },
                "149": {
                    "key": "👞"
                },
                "150": {
                    "key": "👡"
                },
                "151": {
                    "key": "👠"
                },
                "152": {
                    "key": "👢"
                },
                "153": {
                    "key": "👕"
                },
                "154": {
                    "key": "👔"
                },
                "155": {
                    "key": "👚"
                },
                "156": {
                    "key": "👗"
                },
                "157": {
                    "key": "🎽"
                },
                "158": {
                    "key": "👖"
                },
                "159": {
                    "key": "👘"
                },
                "160": {
                    "key": "👙"
                },
                "161": {
                    "key": "💼"
                },
                "162": {
                    "key": "👜"
                },
                "163": {
                    "key": "👝"
                },
                "164": {
                    "key": "👛"
                },
                "165": {
                    "key": "👓"
                },
                "166": {
                    "key": "🎀"
                },
                "167": {
                    "key": "🌂"
                },
                "168": {
                    "key": "💄"
                },
                "169": {
                    "key": "💛"
                },
                "170": {
                    "key": "💙"
                },
                "171": {
                    "key": "💜"
                },
                "172": {
                    "key": "💚"
                },
                "173": {
                    "key": "❤"
                },
                "174": {
                    "key": "💔"
                },
                "175": {
                    "key": "💗"
                },
                "176": {
                    "key": "💓"
                },
                "177": {
                    "key": "💕"
                },
                "178": {
                    "key": "💖"
                },
                "179": {
                    "key": "💞"
                },
                "180": {
                    "key": "💘"
                },
                "181": {
                    "key": "💌"
                },
                "182": {
                    "key": "💋"
                },
                "183": {
                    "key": "💍"
                },
                "184": {
                    "key": "💎"
                },
                "185": {
                    "key": "👤"
                },
                "186": {
                    "key": "👥"
                },
                "187": {
                    "key": "💬"
                },
                "188": {
                    "key": "👣"
                },
                "189": {
                    "key": "💭"
                }
            };

            // 初始化后，半秒就自动回收?
            var self = this;
            setTimeout(function() {
                self.destroy();
            }, 500);
        },
        /**
         * 把元素内的emoji字符，替换为图片
         * @param {dom element} elem 需要替换的元素
         */
        emoji: function(elem) {
            // 考虑到大家都很懒，所以，加一个一个自动初始化的判定
            if (!this._emoji) {
                this.init();
            }

            var html = elem.innerHTML,
                map = this._emoji;

            var key, image;
            for (var i in map) {
                key = map[i].key;
                image = this._image(i, key);

                // 第1个匹配的，是标签，第二个匹配的，是icon
                html = html.replace(this._reg(key), function(str, match1, match2) {
                    return match1 ? match1 : match2 ? image : "";
                });
            }

            elem.innerHTML = html;
        },
        // 回收内存
        destroy: function() {
            // 释放内存
            this._emoji = null;
            delete this._emoji;
        },
        // 正则的MAP
        _rmap: {},
        // 获取对应的正则
        _reg: function(key) {
            var reg = this._rmap[key];
            if (!reg) {
                // /(<[^>]*?[^😄]+?>)|(😄)/g
                // /(<[^>]*?>)|(x)/
                reg = this._rmap[key] = new RegExp("(<[^>]*?>)|(" + key + ")", "g");
            }
            return reg;
        },
        // 组装图片
        _image: function(src, name) {
            return imageTmp + path + src + '.png" alt="' + name + '" />';
        }
    };


    window[NAME] = emoji;

}(window, window.EMOJI_NAME || "ToEmoji");
